ELPasEDT/src/Documents/ЗакреплениеСотрудниковЗаВахтами/ЗакреплениеСотрудниковЗаВахтами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗакреплениеСотрудниковЗаВахтами</name>
  <registerRecords>InformationRegister.СотрудникиПоВахтам</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Вахта</name>
      <type>
        <types>CatalogRef.Вахты</types>
      </type>
    </attributes>
    <attributes>
      <name>СтаршийСмены</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ELPasEDT/src/InformationRegisters/СотрудникиПоВахтам/СотрудникиПоВахтам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СотрудникиПоВахтам</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>СтаршийСмены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вахта</name>
    <type>
      <types>CatalogRef.Вахты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ELPasEDT/src/Documents/ЗакреплениеСотрудниковЗаВахтами/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр СотрудникиПоВахтам
	Движения.СотрудникиПоВахтам.Записывать = Истина;
	Для Каждого ТекСтрокаСотрудники Из Сотрудники Цикл
		Движение = Движения.СотрудникиПоВахтам.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
		Движение.Подразделение = Подразделение;
		Движение.Вахта = ТекСтрокаСотрудники.Вахта;
		Движение.СтаршийСмены = ТекСтрокаСотрудники.СтаршийСмены;
	КонецЦикла;

КонецПроцедуры
